---
kind: type
id: T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionISplitParallelFlange
source: html/1e6f5fda-39bd-234c-1d53-af2228af774a.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionISplitParallelFlange

Defines parameters for I-split Parallel Flange structural section.

## Syntax (C#)
```csharp
public class StructuralSectionISplitParallelFlange : StructuralSectionGeneralT
```